yup, successive runs has the correct amount of backends
```tf
  # module.gcpk8sbase.google_compute_backend_service.backend_service will be created
  + resource "google_compute_backend_service" "backend_service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + health_checks                   = [
          + "projects/jds-throwaway-5/global/healthChecks/opta-jd-gcp-test-5",
        ]
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "opta-jd-gcp-test-5"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode        = "RATE"
          + capacity_scaler       = 1
          + group                 = "projects/jds-throwaway-5/zones/us-central1-a/networkEndpointGroups/opta-jd-gcp-test-5-http"
          + max_rate_per_endpoint = 50
          + max_utilization       = 0.8
        }
      + backend {
          + balancing_mode        = "RATE"
          + capacity_scaler       = 1
          + group                 = "projects/jds-throwaway-5/zones/us-central1-b/networkEndpointGroups/opta-jd-gcp-test-5-http"
          + max_rate_per_endpoint = 50
          + max_utilization       = 0.8
        }
      + backend {
          + balancing_mode        = "RATE"
          + capacity_scaler       = 1
          + group                 = "projects/jds-throwaway-5/zones/us-central1-c/networkEndpointGroups/opta-jd-gcp-test-5-http"
          + max_rate_per_endpoint = 50
          + max_utilization       = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }
```

so the error really seems to be related to planning and thinking there is only 1 backend in the beginning